# # '=================Переменные==============='
# # # переменные - это ссылка на ячейку памяти (грубо говоря это хранилище с названием)

# # a = 10
# # b = "hello world"

# # name = 'Katana'
# # number = 20
# # telephone_number = '+996123123123'

# # my_name = 'Sultan'

# # # snake_case - наименование переменной через нижнее подчеркивание (my_name)

# # myName = 'Sultan'

# # # camel_case - наименование переменной через верхний регистр (myName)

# # MyName = 'Sultan'

# # # pascal_case - наименование переменной через верхний регистр начиная с большой буквы



# # 'Правила наименования'
# # # имя = 'katana' - нельзя называть кириллицей
# # # 1number = 23 - нельзя называть начиная с чисел 
# # # my name - нельзя использовать в названии символы, кроме '_'
# # # print = 'hello' - нельзя использовать готовые названия из питона


# # print('hello')

# # number = 20
# # number2 = 10
# # print(number+number2)

# # text1 = 'hello'
# # text2 = 'world'
# # print(text1+' '+text2)


# # '===============Типы данных==============='
# # # int(integer) - целочисленный тип данных
# # num = 12
# # num2 = 34
# # num3 = 0
# # num4 = -2

# # # float - числа с точкой
# # num5 = 0.5
# # num6 = 12.34
# # num7 = -20.0

# # # Decimal - числа с точкой, но точнее
# # num8 = 12.1341212312312321
# # num9 = -0.11111111
# # num10 = 3012.1231231123123123

# # # str(string) - строковый тип данных (текст)

# # name = 'Katana'

# # # prof = '
# # # hello
# # # world 
# # # '


# # text = """
# # hello
# # world
# # """

# # print(text)


# # # литералы - символы, которые обозначают тип данных. У строк это кавычки


# print(input('Введите число: '))















# Data-types:

#         1) Создайте программу, которая запрашивает два числа, затем:
#             a) Сложите два числа
#             b) Умножите их на любое число
#             c) Возведите в квадрат
#             d) Отнимите от квадрата 5555
#             e) Выведите результат на экран.

# num = '4' # '4'
# print('Число:', num)

#         2) Запросите у пользователя год рождения, посчитайте и выведите в терминал следующие данные:
#             a) сколько будет ему через 2 года
#             b) сколько было ему 2 года назад
#             c) Умножьте его возраст на 365 

#         3) Запросите возраст у пользователя и посчитайте количество прожитых секунд, затем отформатируйте строку и выведите в терминал результат в виде "Возраст человека - {год}, количество секунд прожито - {секунды}".

#         4) Запросите стоимость одной штуки шоколада, молока и кофе, дальше запросите количество шоколада, молока и кофе в одной упаковке и вычислите общую стоимость товаров в корзине. Выведите в терминале.

#         5) Напишите программу которая запрашивает ширину и длину прямоугольника, затем выводит периметр прямоугольника в отформатированной строке "Периметр прямоугольника равен: {периметр}" 
#         **ПОДСКАЗКА**
#             Формула нахождения периметра прямоугольника: 2 * (ширина + длина)




